# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!
  
#### Import all the necessary libraries here:

In [1]:
# Libraries
from functools import reduce
import numpy as np
import pandas as pd
from sqlalchemy import create_engine
import random
from random import choice
import requests
import pandas as pd
from bs4 import BeautifulSoup



import sys
sys.executable


# Connection Data
driver = 'mysql+pymysql'
ip = '127.0.0.1'
username = 'root'
password = 'root'
db = 'employees'
connection_string  = f'{driver}://{username}:{password}@{ip}/{db}'
# Engine & Query
engine = create_engine(connection_string)
query = 'SELECT * FROM employees'
# Database Request
employees = pd.read_sql(query,engine)

# Challenge 1

#### Read the `employees` dataset from Ironhack's database:
* db: `employees`
* table: `employees`

Save your data in a variable called `employees`.

In [2]:
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean `Salary` by `Department`?
**Tip**: There are 2 ways to do it: with or without pivot tables. Do it both ways.

In [3]:
# Method 1
employees.groupby(['Department']).sum()

            Years  Salary
Department
HR             14     135
IT             18     195
Sales           5     110

In [5]:
# Method 2
employees.pivot_table(index=["Department"], values='Salary')

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### Now, group the data by more than one column. Use Pandas pivot table function to select the mean `Salary` by `Department` and `Title`.

In [7]:
employees.pivot_table(index=["Department"], columns = 'Title', values='Salary')

Title         VP  analyst  associate
Department
HR          70.0     32.5        NaN
IT          70.0     32.5       60.0
Sales        NaN      NaN       55.0

#### Display the number of `Years` of work experience and the `Salary` for each `Title`. Add `Years` as a column in your pivot table.
**Hint**: Use Pandas documentation to explore the [pivot table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) function.

In [10]:
employees.pivot_table(index=["Department"], values = 'Years')

               Years
Department
HR          4.666667
IT          4.500000
Sales       2.500000

#### Find the mean `Salary` and number of employees in each `Department` and for each job `Title`.

In [14]:
employees.pivot_table(index=["Department"], columns = 'Title', values='Salary')#, aggfunc=np.sum)

Title         VP  analyst  associate
Department
HR          70.0     32.5        NaN
IT          70.0     32.5       60.0
Sales        NaN      NaN       55.0

#### For each `Department` and each job `Title`, find the `Salary` median, minimum, maximum and standard deviation. Comment your results.

In [25]:
#gdf = employees.groupby(['Title','Department'])['Salary'].agg(['count','min','max','mean','median','std'])
#employees.groupby(by=['Title','Department']).std()
employees.pivot_table(index= ['Department','Title'], values= "Salary", aggfunc= [np.mean, np.median, min, max, np.std])

                       mean median    min    max       std
                     Salary Salary Salary Salary    Salary
Department Title
HR         VP          70.0   70.0     70     70       NaN
           analyst     32.5   32.5     30     35  3.535534
IT         VP          70.0   70.0     70     70       NaN
           analyst     32.5   32.5     30     35  3.535534
           associate   60.0   60.0     60     60       NaN
Sales      associate   55.0   55.0     55     55  0.000000

In [ ]:
"""
Median = mean. Std Dev only applicable if >1 person holding a job with that title within the same department.
"""

#### Based on your comments, fill the missing values with an appropriate value.

In [26]:
# your code here
employees.pivot_table(index= ['Department','Title'], values= "Salary", aggfunc= [np.mean, np.median, min, max, np.std]).fillna(0)

                       mean median    min    max       std
                     Salary Salary Salary Salary    Salary
Department Title
HR         VP          70.0   70.0     70     70  0.000000
           analyst     32.5   32.5     30     35  3.535534
IT         VP          70.0   70.0     70     70  0.000000
           analyst     32.5   32.5     30     35  3.535534
           associate   60.0   60.0     60     60  0.000000
Sales      associate   55.0   55.0     55     55  0.000000

#### The stake holders want to know, for each `Department`, the number of employees and how much money is spent on salaries. Could you provide that information?

In [33]:
employees.pivot_table(index= ['Department'], values= "Salary", aggfunc= [sum, len]).fillna(0)

              sum    len
           Salary Salary
Department
HR            135      3
IT            195      4
Sales         110      2

#### For each `Department` and `Title`, find the the total years of work experience and the mean `Salary`.

In [46]:
#employees.pivot_table(index= ['Department','Title'], values= ["Years",'Salary'], aggfunc= [sum, np.mean]).fillna(0)
df1 = employees.pivot_table(index= ['Department','Title'] , values=['Years'], aggfunc=np.sum)
df2 = employees.pivot_table(index= ['Department','Title'] , values=['Salary'], aggfunc=np.mean)
#df2 = pd.pivot_table(employees, values=['Salary'], columns=['Department'], aggfunc=np.mean)
new_df = pd.concat((df1, df2), axis=1)
new_df

                      Years  Salary
Department Title
HR         VP             8    70.0
           analyst        6    32.5
IT         VP             8    70.0
           analyst        3    32.5
           associate      7    60.0
Sales      associate      5    55.0

## Bonus Challenge 1

#### Compute the mean `Salary` after removing the maximum `Salary` for each `Department`. Create the appropriate pivot table.
**Hint**: Write a custom function.

In [ ]:
# your code here

# Challenge 2

#### Read the `fitbit` dataset from Ironhack's database:
* db: `fitbit`
* table: `fitbit`

Save your data in a variable called `fitbit`.

In [ ]:
# your code here

#### Explore you dataset in terms of data types and descriptive statistics.
**Hint**: Use Pandas functions from previous lectures.

In [ ]:
# your code here

#### You suspect that there must be a linear relationship between the `Minutes Very Active` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Very active` vs `Steps`. We'll work with matplotlib next week. As a first introduction, uncomment and complete the following code. You need to replace the # symbol for the correct function arguments.

In [ ]:
import matplotlib.pyplot as plt;

In [ ]:
"""
plt.scatter(#, #)
plt.title(#)
plt.xlabel(#)
plt.ylabel(#)
plt.show()
"""

#### What can you say about `Minutes Very Active` and `Steps`? Write a comment below.

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `Minutes Sedentary` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Sedentary` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `MinutesOfSleep` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `MinutesOfSleep` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`.

In [ ]:
columns = ['Calorie burned', 'Steps', 'Floors', 'Minutes Sedentary', 'Minutes Very Active', 'MinutesOfSleep']

In [ ]:
# your code here

#### Based on the result of the correlation matrix, which of the features are highly correlated with variable `Steps`?
**Hint**: sort the correlations of `Steps` vs the rest of the features in descending order. You can use Pandas `sort_values`.

In [ ]:
# your code here

# Challenge 3

#### Read the `time_grades` dataset from Ironhack's database:
* db: `time_grades`
* table: `time_grades`

Save your data in a variable called `time_grades`.

In [ ]:
# your code here

#### Show visually the frequency distribution of the `time_grades` dataset.

In [ ]:
# your code here

#### Is there a correlation between `Study time` and `Grade`? Use both Pearson and Spearman correlations and comment your results.

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Use matplotlib to visually plot `Study time` vs `Grade`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Could you explain the difference between Pearson and Spearman correlations?

In [ ]:
"""
your commments here
"""